Revit 2027 API
AnalysisDisplayLegendSettings Constructor
Overload List
Name | Description
AnalysisDisplayLegendSettings() |  Constructs a default instance of legend settings.
AnalysisDisplayLegendSettings(AnalysisDisplayLegendSettings) |  Constructs a new copy of the input AnalysisDisplayLegendSettings object.
Top
See Also
Reference
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace